"use client";

import { useState } from "react";
import { FAQItem } from "./faq-item";

export interface FAQType {
  question: string;
  answer: string;
}

const FAQs: FAQType[] = [
  {
    question: "خوشه‌بندی و پیشنهاد خودرو چطور روی هزینه‌ها اثر می‌گذارد؟",
    answer:
      "این فرآیند باعث می‌شود تعداد خودروهای غیرضروری حذف شود و ظرفیت خودروها بهینه استفاده شود، در نتیجه هزینه‌ها کاهش پیدا می‌کند.",
  },
  {
    question: "چطور می‌توانم بین شرکت‌های حمل‌ونقل مختلف مقایسه انجام دهم؟",
    answer:
      "با جستجو و فیلتر بر اساس قیمت، نوع خودرو، موقعیت جغرافیایی و امتیاز مشتریان می‌توانید شرکت‌ها را مقایسه کنید.",
  },
  {
    question: " آیا می‌توانم چند مسیر یا چند خودرو را همزمان مدیریت کنم؟",
    answer:
      "بله، در پنل مدیریتی امکان تعریف و مدیریت چند مسیر و ناوگان مختلف به صورت همزمان وجود دارد.",
  },
  {
    question:
      "اگر مسیر یا تعداد مسافران تغییر کند، سامانه دوباره مسیر را بهینه‌سازی می‌کند؟",
    answer:
      "بله، تغییرات تعداد یا آدرس مسافران به‌صورت خودکار در سامانه اعمال و مسیر جدید محاسبه می‌شود.",
  },
  {
    question:
      "آیا امکان اتصال سامانه به سیستم‌های داخلی شرکت (مثل HR یا حضور و غیاب) وجود دارد؟",
    answer:
      "بله، از طریق API و ماژول‌های اختصاصی می‌توان سامانه را به سیستم‌های داخلی سازمان متصل کرد.",
  },
  {
    question:
      "آیا می‌توانم گزارش هزینه‌ها و عملکرد سرویس‌ها را به صورت ماهانه دریافت کنم؟",
    answer:
      "بله، سامانه گزارش‌های مالی و عملکردی را به صورت روزانه، هفتگی و ماهانه ارائه می‌دهد.",
  },
  {
    question: "چطور می‌توانم راننده یا خودرو جایگزین انتخاب کنم؟",
    answer:
      "از طریق پنل مدیریتی می‌توانید راننده یا خودرو جایگزین را انتخاب و به سرویس اختصاص دهید.",
  },
  {
    question: "اطلاعات شرکت ما کجا نمایش داده می‌شود؟",
    answer:
      "اطلاعات شرکت شما بعد از ثبت‌نام و تأیید در سامانه، در بخش «لیست شرکت‌های حمل‌ونقل» نمایش داده می‌شود. شرکت‌های خدمات‌گیرنده می‌توانند بر اساس نام، نوع خودرو، قیمت و امتیاز، شما را پیدا کنند.",
  },
  {
    question:
      "چطور می‌توانیم نام یا اطلاعات شرکت خود را در صفحه اول (اولویت نمایش) قرار دهیم؟",
    answer: `
• نمایش در صفحه اول براساس چند شرط انجام می‌شود:
• فعال بودن اشتراک یا پلن ویژه تبلیغاتی
• تکمیل بودن پروفایل شرکت (لوگو، توضیحات، ناوگان، 
قیمت‌ها)
• امتیاز و رضایت مشتریان قبلی
• اولویت جغرافیایی (نزدیک بودن به شرکت خدمات‌گیرنده)`,
  },
  {
    question:
      "اگر شرایط صفحه اول را نداشته باشیم، اطلاعات شرکت کجا قرار می‌گیرد؟",
    answer:
      "در این حالت، شرکت شما در صفحه دوم یا صفحات بعدی لیست می‌آید، اما همچنان قابل جستجو و مقایسه برای خدمات‌گیرنده‌ها خواهد بود.",
  },
];

export function FAQ() {
  const [activeIndex, setActiveIndex] = useState(-1);

  const toggle = (index: number) => {
    setActiveIndex((prev) => (prev === index ? -1 : index));
  };

  return (
    <div className="mt-[72px] mx-6 sm:mx-8 md:mx-[60px] lg:mx-[78.05px] flex flex-col items-center gap-6">
      <h2 className="text-[42px] font-(family-name:--font-yekan-fanum)">
        سوالات متداول
      </h2>

      <div
        className="grid grid-cols-1 md:grid-cols-2 gap-6 font-(family-name:--font-vazirmatn)"
        dir="rtl"
      >
        <div className="flex flex-col gap-2">
          {FAQs.slice(0, 5).map((item, i) => (
            <FAQItem
              key={i}
              question={item.question}
              answer={item.answer}
              isOpen={activeIndex === i}
              onClick={() => toggle(i)}
            />
          ))}
        </div>

        <div className="flex flex-col gap-2">
          {FAQs.slice(5, 10).map((item, i) => (
            <FAQItem
              key={5 + i}
              question={item.question}
              answer={item.answer}
              isOpen={activeIndex === 5 + i}
              onClick={() => toggle(5 + i)}
            />
          ))}
        </div>
      </div>
    </div>
  );
}
